app/controllers/api/albums_controller.rb

SELECT  "albums".* FROM "albums" WHERE (37) LIMIT $1  [["LIMIT", 1]]
---
    def index
        @albums = Album.all

INSERT INTO "albums" ("title", "user_id") VALUES ($1, $2) RETURNING "id"  [["title", "heasfasfy"], ["user_id", 109]]
---
    def create

        @album = current_user.albums.new(album_params)
            if @album.save