app/controllers/api/albums_controller.rb

SELECT  "albums".* FROM "albums" WHERE (37) LIMIT $1  [["LIMIT", 1]]
---
    def show
        @album = Album.find_by(params[:id])